comparison/client/new/probe.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
    xmlns:pub="http://schemas.microsoft.com/windows/pub/2005/07"
    xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsdp="http://schemas.xmlsoap.org/ws/2006/02/devprof"
>
    <soap:Header>
        <wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Probe</wsa:Action>
        <wsa:MessageID>urn:uuid:e144c248-40ae-4151-ab53-75cb4855f0e5</wsa:MessageID>
    </soap:Header>
    <soap:Body>
        <wsd:Probe>
            <wsd:Types>wsdp:Device</wsd:Types>
        </wsd:Probe>
    </soap:Body>
</soap:Envelope>
